Repository: EricMeo7/Fantasy-Dinasty
Catalog: Resources/SharedResource.*.resx
Languages: it

# Required
source: Required field.
it: Campo obbligatorio.

# EmailInvalid
source: Invalid email.
it: Email non valida.

# PasswordLength
source: Password must be at least 6 characters.
it: La password deve essere di almeno 6 caratteri.

source: User not found.
it: Utente non trovato.

source: Login failed.
it: Login fallito.

# NotFound
source: Resource not found.
it: Risorsa non trovata.

# TradeOfferRequired
source: Trade must contain at least one offer.
it: Lo scambio deve contenere almeno un'offerta.

# BidInvalidPlayer
source: Invalid Player ID.
it: ID Giocatore non valido.

# BidAmountZero
source: Bid amount must be greater than 0.
it: L'offerta deve essere maggiore di 0.

# BidDuration
source: Contract duration must be between 1 and 3 years.
it: Il contratto deve durare tra 1 e 3 anni.

source: League ID required.
it: League ID richiesto.

source: User ID required.
it: User ID richiesto.

source: Email already registered.
it: Email già registrata nel sistema.

source: Firebase not configured.
it: Firebase non configurato.

# InvalidCredentials
source: Invalid email or password.
it: Email o password non validi.

# RegistrationSuccess
source: Registration successful!
it: Registrazione avvenuta con successo!

# TwoFactorCodeInvalid
source: Invalid 2FA code.
it: Codice di verifica 2FA non valido.

# FirebaseTokenInvalid
source: Invalid Firebase token.
it: Token Firebase invalido.

# ForgotPasswordMessage
source: If the email is associated with an account, you will receive a password reset link.
it: Se l'indirizzo email è associato a un account, riceverai un link per reimpostare la password.

# PasswordResetNotAvailable
source: Password reset service unavailable.
it: Servizio di reset password non disponibile.

# IdentityDefaultError
source: An unknown failure has occurred.
it: Si è verificato un errore sconosciuto.

# IdentityPasswordTooShort
source: Passwords must be at least {0} characters.
it: La password deve essere di almeno {0} caratteri.

# IdentityPasswordRequiresNonAlphanumeric
source: Passwords must have at least one non alphanumeric character.
it: La password deve contenere almeno un carattere non alfanumerico.

# IdentityPasswordRequiresDigit
source: Passwords must have at least one digit ('0'-'9').
it: La password deve contenere almeno un numero ('0'-'9').

# IdentityPasswordRequiresLower
source: Passwords must have at least one lowercase ('a'-'z').
it: La password deve contenere almeno una lettera minuscola ('a'-'z').

# IdentityPasswordRequiresUpper
source: Passwords must have at least one uppercase ('A'-'Z').
it: La password deve contenere almeno una lettera maiuscola ('A'-'Z').

# IdentityDuplicateEmail
source: Email '{0}' is already taken.
it: L'email '{0}' è già in uso.

# IdentityDuplicateUserName
source: User Name '{0}' is already taken.
it: Il nome utente '{0}' è già in uso.

source: Official Injury Report imported.
it: Report infortuni ufficiale importato.

source: Error importing injury report.
it: Errore durante l'importazione del report infortuni.

# NbaScheduleUpdated
source: NBA Schedule Updated (Game Times Populated).
it: Calendario NBA aggiornato (Orari partite inseriti).
